# Домашнее задание:
# Николай решил вспомнить старые времена. В свое время было модно писать сообщения с чередующимися заглавной
# и малой буквами.
# Он захотел изобрести функцию, которая будет делать с любой предоставленной строкой аналогичное.

# Ваша задача: повторить труд студента camel(st) с учетом того, что пробелы и знаки препинания не должны портить
# чередование регистра символов
# (они в этом процессе не учитываются, но возвращаются в итоговой строке).

def camel(st):

    r = ''
    for s in range(len(st)):
        if s % 2 == 0:
            r += st[s].upper()
        else:
            r += st[s].lower()
    return r


string = input("Введите строку ")


def main():
    print(camel(string))


if __name__ == "__main__":
    main()