
# Домашнее задание
# (Время: 1 сек. Память: 16 Мб Сложность: 27%)
# Петя успевает по математике лучше всех в классе,
# поэтому учитель задал ему сложное домашнее задание, в котором нужно в заданном наборе целых
# чисел найти сумму всех положительных элементов, затем найти где в заданной последовательности
# находятся максимальный и минимальный элемент и вычислить произведение чисел, расположенных
# в этой последовательности между ними. Так же известно, что минимальный и максимальный элемент
# встречаются в заданном множестве чисел только один раз и не являются соседними.
# Поскольку задач такого рода учитель дал Пете около ста, то Петя как сильный программист смог
# написать программу, которая по заданному набору чисел самостоятельно находит решение. А Вам слабо?
#
# Входные данные
# В первой строке входного файла PETR.TXT записано единственное число N – количество элементов массива.
# Вторая строка содержит N целых чисел, представляющих заданный массив. Все элементы массива разделены пробелом.
# Каждое из чисел во входном файле, в том числе и N, не превышает 10^2 по абсолютной величине.
#
# Выходные данные
# В единственную строку выходного файла OUTPUT.TXT нужно вывести два числа, разделенных пробелом:
# сумму положительных элементов и произведение чисел, расположенных между минимальным и максимальным элементами.
# Значения суммы и произведения не превышают по модулю 3^10**4.

# n = int(input())
# a = list(map(int, input().split()))

def max_min_num(pet):
    min_index = 0
    max_index = 0
    for i in range(len(pet)):
        if pet[i] < pet[min_index]:
            min_index = i
        if pet[i] > pet[max_index]:
            max_index = i
    if min_index > max_index:
        min_index, max_index = max_index, min_index
    return min_index, max_index


def sum_numbers(pet):
    pos_sum = 0
    for i in range(len(pet)):
        if pet[i] > 0:
            pos_sum += pet[i]
    return pos_sum


def product(pet, min_index, max_index):
    prod = 1
    for i in range(min_index+1, max_index):
        prod *= pet[i]
    return prod


def main():
    pet = list(map(int, input("Введите элементы массива: ").split()))
    pos_sum = sum_numbers(pet)
    min_index, max_index = max_min_num(pet)
    print(pos_sum, product(pet, min_index, max_index))


if __name__ == "__main__":
    main()






# with open('PETR.TXT', 'r') as f:
#     n1 = int(f.readline())
#     pet = list(map(int, f.readline().split()))
#
# pos_sum, product = sum_and_prod(pet)
#
# with open('OUTPUT.TXT', 'w') as f:
#     f.write('{} {}'.format(pos_sum, prod))